
for i in range(10, 31):
    print(i)

print()

y = 10
while y in range(10, 31):
    print(y)
    y = y + 1

print()

x = 10
while True:
    print(x)
    x = x + 1
    if not x in range(10, 31):
        break





# Написать программу в виде оператора цикла с параметром,
# обеспечивающий вывод на экран "столбиком" всех целых чисел от 10 до 30.
# Оформить этот фрагмент в виде:
# а. оператора цикла с предусловием
# б. оператора цикла с постусловием.
